In [1]:
import pandas as pd

In [2]:
data = [["Alex",5],["Rashi",45]]
df = pd.DataFrame(data,columns=["Name","Age"])
df

    Name  Age
0   Alex    5
1  Rashi   45

In [12]:
data = {"Name":["Prabhat","Rahul","Prithvi"],"Age":[20,30,40]}
df = pd.DataFrame(data)
df

      Name  Age
0  Prabhat   20
1    Rahul   30
2  Prithvi   40

In [19]:
df["Company"] =

      Name  Age
0  Prabhat   20
1    Rahul   30